app/views/bookmarks/index.html.erb

SELECT COUNT(*) FROM "entries" WHERE "entries"."recruit_id" = ?  [["recruit_id", 1]]
---
						<span class="job-description"><%= recruit.job_description %></span>
						<span><%= recruit.entries.count %>エントリー</span>