app/views/feeds/_favorite_form.html.erb

SELECT  "favorites".* FROM "favorites" WHERE "favorites"."user_id" = ? AND "favorites"."feed_id" = ? LIMIT ?  [["user_id", 3], ["feed_id", 1], ["LIMIT", 1]]
---
<% if current_user.favorites.find_by(feed_id: feed.id) %>

SELECT COUNT(*) FROM "favorites" WHERE "favorites"."feed_id" = ?  [["feed_id", 1]]
---
		<% end %>
		<span><%= feed.favorites.count %>いいね</span>

SELECT COUNT(*) FROM "favorites" WHERE "favorites"."feed_id" = ?  [["feed_id", 1]]
---
		<% end %>
		<span><%= feed.favorites.count %>いいね</span>