app/views/entries/index.html.erb

SELECT  "rooms".* FROM "rooms" WHERE "rooms"."user_id" = ? AND "rooms"."company_id" = ? LIMIT ?  [["user_id", 2], ["company_id", 2], ["LIMIT", 1]]
---
                <td>
                    <% room = current_user.rooms.find_by(company_id: entry.recruit.company) %>