app/controllers/admin/companies_controller.rb

UPDATE "companies" SET "logo_id" = ?, "establish_year" = ?, "establish_month" = ?, "link" = ?, "mission_title" = ?, "mission_body" = ?, "value" = ?, "what" = ?, "why" = ?, "how" = ?, "updated_at" = ? WHERE "companies"."id" = ?
---
	def update
		if @company.update!(company_params)

SELECT  "users".* FROM "users" WHERE "users"."deleted_at" IS NULL AND "users"."email" = ? LIMIT ?  [["email", "ashitani0803@gmail.com"], ["LIMIT", 1]]
---
	def invite
		if params[:email]
			user = User.find_by(email: params[:email])

SELECT  "companies".* FROM "companies" WHERE "companies"."deleted_at" IS NULL AND "companies"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."deleted_at" IS NULL AND "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "users" SET "company_id" = ?, "authority_status" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["company_id", 1], ["authority_status", 1], ["updated_at", "2020-03-01 11:13:28.439509"], ["id", 3]]
---
	def add_employee
		company = Company.find(params[:company_id])
		user = User.find(params[:id])
		user.company_id = company.id
		user.authority_status = "general"
		user.save

SELECT  "users".* FROM "users" WHERE "users"."deleted_at" IS NULL AND "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "users" SET "authority_status" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["authority_status", 0], ["updated_at", "2020-03-01 11:17:03.838859"], ["id", 3]]
---
	def add_authority
		member = User.find(params[:id])
		member.authority_status = "admin"
		member.save

SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
	def remove_authority
		member = User.find(params[:id])