app/controllers/admin/entries_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."deleted_at" IS NULL AND "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT  "rooms".* FROM "rooms" WHERE "rooms"."company_id" = ? AND "rooms"."user_id" = ? LIMIT ?  [["company_id", 1], ["user_id", 2], ["LIMIT", 1]]
---
  def candidate_show
	@candidate = User.find(params[:id])
	@room = @company.rooms.find_by(user_id: @candidate.id)