app/controllers/admin/feeds_controller.rb

INSERT INTO "feeds" ("company_id", "title", "image_id", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    @feed = Feed.new(feed_params)
    @feed.company_id = @company.id
    if @feed.save

UPDATE "feeds" SET "title" = ?, "image_id" = ?, "updated_at" = ? WHERE "feeds"."id" = ?  [["title", "3回目の投稿!"], ["image_id", "f2741039430ca2152c0258bef36b6e71d43752cca8bbd9a35df5933b186d"], ["updated_at", "2020-03-01 11:41:20.479428"], ["id", 3]]
UPDATE "feeds" SET "status" = ?, "updated_at" = ? WHERE "feeds"."id" = ?  [["status", 0], ["updated_at", "2020-03-03 10:43:54.440682"], ["id", 4]]
---
  def update_status
    if @feed.status == 'draft'
      @feed.status = 'published'
      @feed.save
      flash[:success] = "フィードを公開しました。"
    else
      @feed.status = 'draft'
      @feed.save

UPDATE "feeds" SET "title" = ?, "image_id" = ?, "updated_at" = ? WHERE "feeds"."id" = ?  [["title", "3回目の投稿!"], ["image_id", "f2741039430ca2152c0258bef36b6e71d43752cca8bbd9a35df5933b186d"], ["updated_at", "2020-03-01 11:41:20.479428"], ["id", 3]]
---
  def update
    if @feed.update(feed_params)

SELECT  "feeds".* FROM "feeds" WHERE "feeds"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
---
  def find_feed
    @feed = Feed.find(params[:id])