app/controllers/admin/recruits_controller.rb

  def new
    @recruit = Recruit.new
    @features= Feature.all
---
SELECT "features".* FROM "features"

  def edit
    @features= Feature.all
---
SELECT "features".* FROM "features"

  def update_status
    if @recruit.status == 'draft'
      @recruit.status = 'published'
    else
      @recruit.status = 'draft'
    end
    @recruit.save
---
INSERT INTO "recruits" ("company_id", "title", "do", "occupation", "job_description", "employment_status", "field", "created_at", "updated_at", "image_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def create
    @recruit = Recruit.new(recruit_params)
    @recruit.company_id = @company.id
    if @recruit.save
---
INSERT INTO "recruits" ("company_id", "title", "do", "occupation", "job_description", "employment_status", "field", "created_at", "updated_at", "image_id", "status") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    if @recruit.update(recruit_params)
---
UPDATE "recruits" SET "image_id" = ?, "updated_at" = ? WHERE "recruits"."id" = ?  [["image_id", "6db95bf798b04f6e18da86aa95f3969060bf605890c068af26c721988a0d"], ["updated_at", "2020-03-04 04:01:26.084799"], ["id", 4]]

  def find_recruit
    @recruit = Recruit.find(params[:id])
---
SELECT  "recruits".* FROM "recruits" WHERE "recruits"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]