app/controllers/admin/scouts_controller.rb

	def create
		@scout = @company.scouts.new(user_id: params[:user_id])
		@scout.save
		@user = @scout.user
		@company = current_user.company
		@room = @company.rooms.new(user_id: @user.id)
		@room.save
---
INSERT INTO "scouts" ("company_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["company_id", 1], ["user_id", 2], ["created_at", "2020-03-01 09:47:30.156664"], ["updated_at", "2020-03-01 09:47:30.156664"]]
INSERT INTO "rooms" ("user_id", "company_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 2], ["company_id", 1], ["created_at", "2020-03-01 09:47:30.238304"], ["updated_at", "2020-03-01 09:47:30.238304"]]