app/views/admin/feeds/index.html.erb

					</td>
					<td><%= feed.favorites.count %></td>
---
SELECT COUNT(*) FROM "favorites" WHERE "favorites"."feed_id" = ?  [["feed_id", 4]]