app/views/admin/recruits/index.html.erb

SELECT COUNT(*) FROM "bookmarks" WHERE "bookmarks"."recruit_id" = ?  [["recruit_id", 4]]
---
					</td>
					<td><%= recruit.bookmarks.count %>人</td>