app/views/companies/_follow_form.html.erb

<% if follow = current_user.follows.find_by(company_id: company.id) %>
---
SELECT  "follows".* FROM "follows" WHERE "follows"."user_id" = ? AND "follows"."company_id" = ? LIMIT ?  [["user_id", 1], ["company_id", 1], ["LIMIT", 1]]