app/views/companies/show.html.erb

SELECT COUNT(*) FROM "users" WHERE "users"."deleted_at" IS NULL AND "users"."company_id" = ?  [["company_id", 1]]
SELECT "users".* FROM "users" WHERE "users"."deleted_at" IS NULL AND "users"."company_id" = ?  [["company_id", 1]]
---
		<ul>
			<% @company.users.each do |member| %>

SELECT COUNT(*) FROM "users" WHERE "users"."deleted_at" IS NULL AND "users"."company_id" = ?  [["company_id", 1]]
---
		<li><i class="fas fa-user"></i><%= @company.person_name %>が創業</li>
		<li><i class="fas fa-users"></i><%= @company.users.count %>人のメンバー</li>