app/controllers/bookmarks_controller.rb

SELECT  "recruits".* FROM "recruits" WHERE "recruits"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "bookmarks" ("user_id", "recruit_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 3], ["recruit_id", 1], ["created_at", "2020-03-01 08:50:00.916261"], ["updated_at", "2020-03-01 08:50:00.916261"]]
---
	def create
		@recruit = Recruit.find(params[:recruit_id])
		@bookmark = current_user.bookmarks.new(recruit_id: params[:recruit_id])
		@bookmark.save

SELECT  "recruits".* FROM "recruits" WHERE "recruits"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "bookmarks".* FROM "bookmarks" WHERE "bookmarks"."user_id" = ? AND "bookmarks"."recruit_id" = ? LIMIT ?  [["user_id", 3], ["recruit_id", 1], ["LIMIT", 1]]
DELETE FROM "bookmarks" WHERE "bookmarks"."id" = ?  [["id", 16]]
---
	def destroy
		@recruit = Recruit.find(params[:recruit_id])
		@bookmark = Bookmark.find_by(user_id: current_user.id, recruit_id: params[:recruit_id])
		@bookmark.destroy