app/controllers/companies_controller.rb

SELECT  "companies".* FROM "companies" WHERE "companies"."deleted_at" IS NULL AND "companies"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "addresses".* FROM "addresses" WHERE "addresses"."company_id" = ? AND "addresses"."head_status" = ? LIMIT ?  [["company_id", 1], ["head_status", 0], ["LIMIT", 1]]
---
  def about
    @company = Company.find(params[:id])
    @headquarters = @company.addresses.find_by(head_status: "head")

SELECT  "companies".* FROM "companies" WHERE "companies"."deleted_at" IS NULL AND "companies"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "addresses".* FROM "addresses" WHERE "addresses"."company_id" = ? AND "addresses"."head_status" = ? LIMIT ?  [["company_id", 1], ["head_status", 0], ["LIMIT", 1]]
---
  def member
    @company = Company.find(params[:id])
    @headquarters = @company.addresses.find_by(head_status: "head")

SELECT  "companies".* FROM "companies" WHERE "companies"."deleted_at" IS NULL AND "companies"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "addresses".* FROM "addresses" WHERE "addresses"."company_id" = ? AND "addresses"."head_status" = ? LIMIT ?  [["company_id", 1], ["head_status", 0], ["LIMIT", 1]]
---
  def show
    @company = Company.find(params[:id])
    @headquarters = @company.addresses.find_by(head_status: "head")

SELECT  1 AS one FROM "users" WHERE "users"."email" = ? AND "users"."deleted_at" IS NULL LIMIT ?  [["email", "ashitani.riku.infratop@gmail.com"], ["LIMIT", 1]]
INSERT INTO "companies" ("company_name", "person_name", "email", "phone_number", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
INSERT INTO "users" ("email", "encrypted_password", "created_at", "updated_at", "name", "company_id", "authority_status", "phone_number") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @company = Company.new(company_params)
    if User.find_by(email: @company.email)
      admin = User.find_by(email: @company.email)
      if admin.company_id.present?
        flash.now[:alert] = "会社の登録に失敗しました。"
        render :new
      else
        admin.name = @company.person_name
        admin.phone_number = @company.phone_number
        admin.authority_status = "admin"
        if @company.save