app/controllers/entries_controller.rb

SELECT  "recruits".* FROM "recruits" WHERE "recruits"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "entries" ("user_id", "recruit_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 3], ["recruit_id", 1], ["created_at", "2020-03-04 04:28:46.251778"], ["updated_at", "2020-03-04 04:28:46.251778"]]
INSERT INTO "rooms" ("user_id", "company_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 3], ["company_id", 1], ["created_at", "2020-03-04 04:28:46.332423"], ["updated_at", "2020-03-04 04:28:46.332423"]]
---
	def create
		@recruit = Recruit.find(params[:recruit_id])
		@entry = current_user.entries.new(recruit_id: params[:recruit_id])
		@entry.save
		@company = @recruit.company
		@room = current_user.rooms.new(company_id: @company.id)
		@room.save