app/controllers/favorites_controller.rb

	def create
		@like = current_user.favorites.new(feed_id: params[:feed_id])
		@like.save
		@feed = Feed.find(params[:feed_id])
---
INSERT INTO "favorites" ("user_id", "feed_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 3], ["feed_id", 1], ["created_at", "2020-03-01 05:28:28.963839"], ["updated_at", "2020-03-01 05:28:28.963839"]]
SELECT  "feeds".* FROM "feeds" WHERE "feeds"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

	def destroy
		@like = Favorite.find_by(user_id: current_user.id, feed_id: params[:feed_id])
		@like.destroy
		@feed = Feed.find(params[:feed_id])
---
SELECT  "favorites".* FROM "favorites" WHERE "favorites"."user_id" = ? AND "favorites"."feed_id" = ? LIMIT ?  [["user_id", 3], ["feed_id", 2], ["LIMIT", 1]]
DELETE FROM "favorites" WHERE "favorites"."id" = ?  [["id", 2]]
SELECT  "feeds".* FROM "feeds" WHERE "feeds"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]