app/controllers/feeds_controller.rb

  def index
  	@feeds = Feed.all
---
SELECT "feeds".* FROM "feeds"

  def show
  	@feed = Feed.find(params[:id])
---
SELECT  "feeds".* FROM "feeds" WHERE "feeds"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

  def company_feed
  	@company = Company.find(params[:id])
  	@feeds = @company.feeds
    @headquarters = @company.addresses.find_by(head_status: "head")
---
SELECT  "companies".* FROM "companies" WHERE "companies"."deleted_at" IS NULL AND "companies"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "addresses".* FROM "addresses" WHERE "addresses"."company_id" = ? AND "addresses"."head_status" = ? LIMIT ?  [["company_id", 1], ["head_status", 0], ["LIMIT", 1]]