app/controllers/follows_controller.rb

INSERT INTO "follows" ("company_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["company_id", 1], ["user_id", 3], ["created_at", "2020-03-01 09:29:44.386766"], ["updated_at", "2020-03-01 09:29:44.386766"]]
SELECT  "companies".* FROM "companies" WHERE "companies"."deleted_at" IS NULL AND "companies"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
	def create
		@follow = current_user.follows.new(company_id: params[:company_id])
		@follow.save
		@company = Company.find(params[:company_id])

SELECT  "follows".* FROM "follows" WHERE "follows"."user_id" = ? AND "follows"."company_id" = ? LIMIT ?  [["user_id", 3], ["company_id", 1], ["LIMIT", 1]]
DELETE FROM "follows" WHERE "follows"."id" = ?  [["id", 1]]
SELECT  "companies".* FROM "companies" WHERE "companies"."deleted_at" IS NULL AND "companies"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
	def destroy
		@follow = Follow.find_by(user_id: current_user.id, company_id: params[:company_id])
		@follow.destroy
		@company = Company.find(params[:company_id])