app/controllers/messages_controller.rb

SELECT  "rooms".* FROM "rooms" WHERE "rooms"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "messages" ("room_id", "is_user", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["room_id", 1], ["is_user", 0], ["content", "初めまして！"], ["created_at", "2020-03-01 09:47:55.567001"], ["updated_at", "2020-03-01 09:47:55.567001"]]
---
	def create
		@room = Room.find(params[:room_id])
		@message = Message.new(message_params)
		if current_user.authority_status == "admin"
			@message.is_user = false
		else
			@message.is_user = true
		end
		@message.room_id = @room.id
		@message.save