app/controllers/recruits_controller.rb

SELECT "recruits".* FROM "recruits"
---
  def index
    @recruits = Recruit.all

SELECT  "recruits".* FROM "recruits" WHERE "recruits"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."deleted_at" IS NULL AND "users"."company_id" = ? AND "users"."authority_status" = ?  [["company_id", 1], ["authority_status", 0]]
SELECT  "recruit_features".* FROM "recruit_features" WHERE "recruit_features"."recruit_id" = ? AND "recruit_features"."feature_id" = ? LIMIT ?  [["recruit_id", 1], ["feature_id", 2], ["LIMIT", 1]]
SELECT  "addresses".* FROM "addresses" WHERE "addresses"."company_id" = ? AND "addresses"."head_status" = ? LIMIT ?  [["company_id", 1], ["head_status", 0], ["LIMIT", 1]]
---
  def show
    @recruit = Recruit.find(params[:id])
    @company = @recruit.company
    @members = @company.users.where(authority_status: "admin").sample(4)
    @recruit_feature = @recruit.recruit_features.find_by(feature_id: 2)
    @headquarters = @company.addresses.find_by(head_status: "head")

SELECT  "companies".* FROM "companies" WHERE "companies"."deleted_at" IS NULL AND "companies"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "addresses".* FROM "addresses" WHERE "addresses"."company_id" = ? AND "addresses"."head_status" = ? LIMIT ?  [["company_id", 1], ["head_status", 0], ["LIMIT", 1]]
---
  def company_index
    @company = Company.find(params[:id])
    @recruits = @company.recruits
    @headquarters = @company.addresses.find_by(head_status: "head")

SELECT "companies".* FROM "companies" WHERE "companies"."deleted_at" IS NULL AND (company_name LIKE '%#{search}%')
SELECT "users".* FROM "users" WHERE "users"."deleted_at" IS NULL AND (name LIKE '%大学%' OR introduction LIKE '%大学%' OR educational_background LIKE '%大学%' OR work_experience LIKE '%大学%')
SELECT  "recruits".* FROM "recruits" ORDER BY "recruits"."id" DESC LIMIT ? OFFSET ?  [["LIMIT", 1], ["OFFSET", 0]]
SELECT "recruits".* FROM "recruits" WHERE "recruits"."occupation" IS NULL AND "recruits"."employment_status" IS NULL
---
  def search
    if params[:id] == "2"
      @companies = Company.all
    elsif params[:id] == "3"
      @users = User.all
    elsif params[:id] == "1"
      @recruits = Recruit.all
    elsif params[:search]
      @recruits = Recruit.recruit_search(params[:search])
      @companies = Company.company_search(params[:search])
      @users = User.user_search(params[:search])
    else
      results = []
      recruits = Recruit.where(occupation: params[:occupation], employment_status: params[:employment_status])
      if params[:search_word]
        @recruits = []
        words = Recruit.recruit_search(params[:search_word])
        recruits.each do |r|