app/controllers/rooms_controller.rb

SELECT  "companies".* FROM "companies" WHERE "companies"."deleted_at" IS NULL AND "companies"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "rooms".* FROM "rooms" WHERE "rooms"."user_id" = ? AND "rooms"."company_id" = ? LIMIT ?  [["user_id", 3], ["company_id", 1], ["LIMIT", 1]]
---
	def show
		@company = Company.find(params[:company_id])
		@room = current_user.rooms.find_by(company_id: @company.id)