app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."deleted_at" IS NULL AND "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def show
  	@user = User.find(params[:id])

UPDATE "users" SET "introduction" = ?, "educational_background" = ?, "work_experience" = ?, "image_id" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["introduction", "こんにちわ"], ["educational_background", "〇〇大学"], ["work_experience", "フリーター"], ["image_id", nil], ["updated_at", "2020-02-28 15:33:24.395144"], ["id", 1]]
---
  def update
  	if @user.update(user_update_params)

SELECT  "companies".* FROM "companies" WHERE "companies"."deleted_at" IS NULL AND "companies"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."deleted_at" IS NULL AND "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
  def become_employee
    @company = Company.find(params[:company_id])
    @user = User.find(params[:id])