app/views/recruits/_bookmark_form.html.erb

	</li>
<% elsif current_user.bookmarks.find_by(recruit_id: recruit.id) %>
---
SELECT  "bookmarks".* FROM "bookmarks" WHERE "bookmarks"."user_id" = ? AND "bookmarks"."recruit_id" = ? LIMIT ?  [["user_id", 1], ["recruit_id", 1], ["LIMIT", 1]]