app/views/recruits/company_index.html.erb

						<span class="job-description"><%= recruit.job_description %></span>
						<span><%= recruit.entries.count %>エントリー</span>
---
SELECT COUNT(*) FROM "entries" WHERE "entries"."recruit_id" = ?  [["recruit_id", 1]]