app/views/recruits/index.html.erb

SELECT "recruits".* FROM "recruits"
SELECT "features".* FROM "features"
---
		<%= text_field_tag :search_word, '', :placeholder => "キーワードで検索", class: "form-control" %><br>
		<%= select :recruit, :occupation, Recruit.occupations_i18n.keys.map {|k| [I18n.t("enums.recruit.occupation.#{k}"), k]}, {include_blank: true}, class: "form-control" %><br>
		<%= select :recruit, :employment_status, Recruit.employment_statuses_i18n.keys.map {|k| [I18n.t("enums.recruit.employment_status.#{k}"), k]}, {include_blank: true}, class: "form-control" %>
		<h5>特徴</h5>
		<%= collection_select(:feature, :feature_id, Feature.all, :id, :feature, {include_blank: true}, {class: "form-control"}) %><br>

SELECT COUNT(*) FROM "entries" WHERE "entries"."recruit_id" = ?  [["recruit_id", 1]]
---
						<span class="job-description"><%= recruit.job_description %></span>
						<span><%= recruit.entries.count %>エントリー</span>