app/views/recruits/search.html.erb

SELECT  "addresses".* FROM "addresses" WHERE "addresses"."company_id" = ? AND "addresses"."head_status" = ? LIMIT ?  [["company_id", 1], ["head_status", 1], ["LIMIT", 1]]
---
                        #本社のある住所を取得
                        <% if address = recruit.company.addresses.find_by(head_status: 1) %>