app/views/recruits/show.html.erb

	<div>
		<% if current_user.supports.find_by(recruit_id: @recruit.id) %>
---
SELECT  "supports".* FROM "supports" WHERE "supports"."user_id" = ? AND "supports"."recruit_id" = ? LIMIT ?  [["user_id", 3], ["recruit_id", 2], ["LIMIT", 1]]

		<ul>
			<% @company.users.each do |member| %>
---
SELECT "users".* FROM "users" WHERE "users"."deleted_at" IS NULL AND "users"."company_id" = ?  [["company_id", 1]]