app/views/recruits/show.html.erb

		<span><%= @recruit.job_description %></span>
		<span><strong><%= @recruit.entries.count %></strong>エントリー</span>
---
SELECT COUNT(*) FROM "entries" WHERE "entries"."recruit_id" = ?  [["recruit_id", 1]]

		<% end %>
		<% if current_user.entries.find_by(recruit_id: @recruit.id) %>
---
SELECT  "entries".* FROM "entries" WHERE "entries"."user_id" = ? AND "entries"."recruit_id" = ? LIMIT ?  [["user_id", 2], ["recruit_id", 1], ["LIMIT", 1]]

		<p class="side-content">
			<%= @recruit.entries.count %>人がエントリー中
---
SELECT COUNT(*) FROM "entries" WHERE "entries"."recruit_id" = ?  [["recruit_id", 1]]

		<p class="side-content">
			<%= @recruit.supports.count %>人が応援しています
---
SELECT COUNT(*) FROM "supports" WHERE "supports"."recruit_id" = ?  [["recruit_id", 1]]

		<div class="recruit-support">
			<% if current_user.supports.find_by(recruit_id: @recruit.id) %>
---
SELECT  "supports".* FROM "supports" WHERE "supports"."user_id" = ? AND "supports"."recruit_id" = ? LIMIT ?  [["user_id", 2], ["recruit_id", 1], ["LIMIT", 1]]