app/views/admin/entries/candidate_list.html.erb

    <% @recruits.each do |recruit| %>
        <% recruit.entries.each do |entry| %>
---
SELECT "entries".* FROM "entries" WHERE "entries"."recruit_id" = ?  [["recruit_id", 1]]